const DATA1 = [
  [ "《好汉歌》" ],
  [ "大河向东流哇\n天上的星星参北斗哇", "rgba(255,224,224,1)", "rgba(0,0,0,1)" ],
  [ "说走咱就走哇\n你有我有全都有哇", ],
  [ "路见不平一声吼哇\n该出手时就出手哇\n风风火火闯九州哇", ],
  [ "嘿儿呀 咿儿呀 嘿唉嘿依儿呀\n嘿儿呀 咿儿呀 嘿唉嘿依儿呀", ],
  [ "路见不平一声吼哇\n该出手时就出手哇\n风风火火闯九州哇", ],
  [ "大河向东流哇\n天上的星星参北斗哇", "rgba(255,244,224,1)", "rgba(0,0,0,1)" ],
  [ "说走咱就走哇\n你有我有全都有哇", ],
  [ "路见不平一声吼哇\n该出手时就出手哇\n风风火火闯九州哇", ],
  [ "嘿儿呀 咿儿呀 嘿唉嘿依儿呀\n嘿儿呀 咿儿呀 嘿唉嘿依儿呀", ],
  [ "路见不平一声吼哇\n该出手时就出手哇\n风风火火闯九州哇", ],
  [ "路见不平一声吼哇\n该出手时就出手哇\n风风火火闯九州哇", ],
  [ "嘿儿呀 咿儿呀 嘿唉嘿依儿呀\n嘿儿呀 咿儿呀 嘿唉嘿依儿呀", ],
  [ "路见不平一声吼哇\n该出手时就出手哇\n风风火火闯九州哇", ],
]

const DATA2 = [
  [ "《甜蜜蜜》" ],
  [ "甜蜜蜜\n你笑得甜蜜蜜\n好像花儿开在春风里\n开在春风里", "rgba(224,255,224,1)", "rgba(0,0,0,1)" ],
  [ "在哪里\n在哪里见过你\n你的笑容这样熟悉\n我一时想不起" ],
  [ "啊在梦里\n梦里梦里见过你" ],
  [ "甜蜜笑得多甜蜜" ],
  [ "是你是你\n梦见的就是你" ],
  [ "在哪里\n在哪里见过你\n你的笑容这样熟悉\n我一时想不起", "rgba(240,255,240,1)" ],
  [ "啊在梦里\n梦里梦里见过你" ],
  [ "甜蜜笑得多甜蜜" ],
  [ "是你是你\n梦见的就是你" ],
  [ "在哪里\n在哪里见过你\n你的笑容这样熟悉\n我一时想不起" ],
  [ "啊 在梦里", "rgba(255,224,224,1)" ],
]

const DATA3 = [
  [ "《万水千山总是情》" ],
  [ "莫说青山多障碍\n风也急风也劲\n白云过山峰也可传情", "#994", "#fff" ],
  [ "莫说水中多变幻\n水也清水也静\n柔情似水爱共永" ],
  [ "未怕罡风吹散了热爱\n万水千山总是情" ],
  [ "聚散也有天注定\n不怨天不怨命\n但求有山水共作证" ],
  [ "莫说青山多障碍\n风也急风也劲\n白云过山峰也可传情" ],
  [ "莫说水中多变幻\n水也清水也静\n柔情似水爱共永" ],
  [ "未怕罡风吹散了热爱\n万水千山总是情" ],
  [ "聚散也有天注定\n不怨天不怨命\n但求有山水共作证\n但求有山水共作证" ]
]

const DATA4 = [
  [ "《敢问路在何方》" ],
  [ "你挑着担，我牵着马；\n迎来日出送走晚霞。", "#CCF" ],
  [ "踏平坎坷成大道，\n斗罢艰险又出发，又出发。" ],
  [ "啦啦——啦啦啦啦啦啦啦啦，\n一番番春秋冬夏，\n一场场酸甜苦辣；" ],
  [ "敢问路在何方？\n路在脚下。" ],
  [ "你挑着担，我牵着马；\n翻山涉水两肩霜花。" ],
  [ "风云雷电任叱咤，\n一路豪歌向天涯，向天涯。" ],
  [ "啦啦——啦啦啦啦啦啦啦啦，" ],
  [ "一番番春秋冬夏，\n一场场酸甜苦辣；" ],
  [ "敢问路在何方？\n路在脚下。" ],
  [ "敢问路在何方？\n路在脚下。", "#CCF", "#339" ],
]

const DATA5 = [
  [ "《我的中国心》" ],
  [ "河山只在我梦萦\n祖国已多年未亲近\n可是不管怎样也改变不了\n我的中国心", "#FCC", "#300" ],
  [ "洋装虽然穿在身\n我心依然是中国心\n我的祖先早已把我的一切\n烙上中国印"],
  [ "长江 长城 黄山 黄河\n在我心中重千斤\n无论何时 无论何地\n心中一样亲" ],
  [ "流在心里的血\n澎湃着中华的声音\n就算生在他乡也改变不了\n我的中国心"],
  [ "长江 长城 黄山 黄河\n在我心中重千斤\n无论何时 无论何地\n心中一样亲" ],
  [ "流在心里的血\n澎湃着中华的声音\n就算生在他乡也改变不了\n我的中国心"]
]

const DATA6 = [
  [ "《难忘今宵》" ],
  [ "难忘今宵难忘今宵\n无论天涯与海角", "#fcc" ],
  [ "神州万里同怀抱\n共祝愿祖国好祖国好" ],
  [ "共祝愿祖国好\n共祝愿祖国好" ],
  [ "难忘今宵难忘今宵\n无论天涯与海角", "#fdd" ],
  [ "神州万里同怀抱\n共祝愿祖国好祖国好" ],
  [ "共祝愿祖国好\n共祝愿祖国好" ],
  [ "告别今宵告别今宵\n无论新友与故交" ],
  [ "明年春来再相邀\n青山在人未老人未老" ],
  [ "青山在人未老\n青山在人未老" ],
  [ "共祝愿祖国好\n共祝愿祖国好" ]
]

const ALLDATA = [ DATA1, DATA2, DATA3, DATA4, DATA5, DATA6 ];